<a href="https://colab.research.google.com/github/IIAnirudhII/BU/blob/master/Deep%20Learning/Lab2/Lab2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1) Working with sheets

In [3]:
import pandas as pd
import numpy as np

In [15]:
df=pd.read_excel("https://github.com/IIAnirudhII/BU/blob/master/Deep%20Learning/Lab2/data/Online%20Retail.xlsx?raw=true")
df=df.dropna()

In [ ]:
subset=df.iloc[:, : 4]
subset=subset[subset["InvoiceNo"]==536544]
(subset)

     InvoiceNo StockCode                      Description  Quantity
1443    536544     21773  DECORATIVE ROSE BATHROOM BOTTLE         1
1444    536544     21774  DECORATIVE CATS BATHROOM BOTTLE         2
1445    536544     21786               POLKADOT RAIN HAT          4
1446    536544     21787            RAIN PONCHO RETROSPOT         2
1447    536544     21790               VINTAGE SNAP CARDS         9
...        ...       ...                              ...       ...
1965    536544     21721        CANDY SHOP  STICKER SHEET         1
1966    536544     21722      SWEET PUDDING STICKER SHEET         1
1967    536544     21731    RED TOADSTOOL LED NIGHT LIGHT         5
1968    536544     21742      LARGE ROUND WICKER PLATTER          1
1969    536544     21758             VINTAGE SHELLS PRINT         1

[527 rows x 4 columns]

In [16]:
data=df.filter(items=['StockCode', 'UnitPrice'])

In [17]:
print("Minimum")
print(data.UnitPrice.min())

Minimum
0.0

In [18]:
print("Maximum")
print(data.UnitPrice.max())

Maximum
38970.0

In [19]:
print("Median")
print(data.UnitPrice.median())

Median
1.95

In [20]:
print("Mean")
print(data.UnitPrice.mean())

Mean
3.4604710185298773

In [21]:
print("Count")
print(data.UnitPrice.count())

Count
406829

In [22]:
print("Sum")
print(data.UnitPrice.sum())

Sum
1407819.964

In [23]:
print("Standard Deviation")
print(data.UnitPrice.std())

Standard Deviation
69.31516172322651

In [25]:
print("Variance")
print(data.UnitPrice.var())

Variance
4804.591644717046

In [ ]:
new_df=df[100:]
new_df.reset_index(inplace=True)

In [ ]:
new_df=new_df.sort_values(["InvoiceDate"])

In [ ]:
Description=pd.Series(new_df["Description"])

In [ ]:
Description=Description.str.startswith('D')

In [ ]:
print("Description starts with D")
new_df[Description.values]

Description starts with D

         index InvoiceNo StockCode  ... UnitPrice  CustomerID         Country
40         140    536381     21523  ...      6.75     15311.0  United Kingdom
41         141   C536379         D  ...     27.50     14527.0  United Kingdom
85         185    536388     21523  ...      7.95     16250.0  United Kingdom
128        228    536390     22654  ...      4.95     17511.0  United Kingdom
119        219    536390     20668  ...      0.10     17511.0  United Kingdom
...        ...       ...       ...  ...       ...         ...             ...
406473  541653    581538     23033  ...      1.45     14446.0  United Kingdom
406471  541651    581538     23034  ...      1.45     14446.0  United Kingdom
406547  541727    581570     23077  ...      1.25     12662.0         Germany
406553  541733    581571     48187  ...      8.25     15311.0  United Kingdom
406713  541893    581586     20685  ...      7.08     13113.0  United Kingdom

[14535 rows x 9 columns]

# 2) Creating dataframe

In [ ]:
# list of lists
data = [['Krish', '10-01-2000',85], ['Jack', '15-06-1999',69], ['Juli', '14-12-2000',99],['Kurt', '27-07-2000',81],['Riti', '01-05-2000',90]] 
  
df1 = pd.DataFrame(data, columns = ['Student Name', 'Date of Birth', 'Marks in maths']) 
  
df1

  Student Name Date of Birth  Marks in maths
0        Krish    10-01-2000              85
1         Jack    15-06-1999              69
2         Juli    14-12-2000              99
3         Kurt    27-07-2000              81
4         Riti    01-05-2000              90

In [ ]:
# dict of narray/lists
data = {'Student Name':['Tom', 'Nick', 'Juli','Kurt','Riti'],  'Date of Birth':['10-01-2000','14-12-2000','27-07-2000' ,'15-06-1999', '14-12-2000'],  'Marks in maths':[77,54,79,76,87]} 
  
df2 = pd.DataFrame(data) 
  
df2

  Student Name Date of Birth  Marks in maths
0          Tom    10-01-2000              77
1         Nick    14-12-2000              54
2         Juli    27-07-2000              79
3         Kurt    15-06-1999              76
4         Riti    14-12-2000              87

In [ ]:
# list of dicts
data = [{'Student Name': 'Kevin', 'Date of Birth': '01-05-2001', 'Marks in maths':86},
        {'Student Name': 'Kurt', 'Date of Birth': '20-03-2000', 'Marks in maths':60},
        {'Student Name': 'Nick', 'Date of Birth': '23-02-1999', 'Marks in maths':92},
        {'Student Name': 'Tom', 'Date of Birth': '15-04-1999', 'Marks in maths':90},
        {'Student Name': 'Riti', 'Date of Birth': '01-07-1999', 'Marks in maths':76}] 
  
df3 = pd.DataFrame(data) 
  
df3

  Student Name Date of Birth  Marks in maths
0        Kevin    01-05-2001              86
1         Kurt    20-03-2000              60
2         Nick    23-02-1999              92
3          Tom    15-04-1999              90
4         Riti    01-07-1999              76

In [ ]:
# dict of series

d = {'Student Name' : pd.Series(['Tom', 'Nick', 'Jack','Riti','Kurt']), 
      'Date of Birth' : pd.Series(['10-01-2000', '23-02-1999', '15-06-1999','01-07-1999','15-04-1999']),
     'Marks in maths' : pd.Series([75, 45, 90,76,90 ])} 
  
df4 = pd.DataFrame(d) 
  
df4

  Student Name Date of Birth  Marks in maths
0          Tom    10-01-2000              75
1         Nick    23-02-1999              45
2         Jack    15-06-1999              90
3         Riti    01-07-1999              76
4         Kurt    15-04-1999              90

In [ ]:
# appending to empty dataframe
df5 = pd.DataFrame(columns=['Student Name', 'Date of Birth', 'Marks in english'])

df5 = df5.append({'Student Name': 'Riti', 'Date of Birth': '10-01-2000', 'Marks in english': 54}, ignore_index=True)
df5 = df5.append({'Student Name': 'Nick', 'Date of Birth': '20-03-2000', 'Marks in english': 98}, ignore_index=True)
df5 = df5.append({'Student Name': 'Kevin', 'Date of Birth': '01-05-1999', 'Marks in english': 63}, ignore_index=True)
df5 = df5.append({'Student Name': 'Tom', 'Date of Birth': '23-02-1999', 'Marks in english': 38}, ignore_index=True)
df5 = df5.append({'Student Name': 'Jack', 'Date of Birth': '01-07-1999', 'Marks in english': 94}, ignore_index=True)

df5

  Student Name Date of Birth Marks in english
0         Riti    10-01-2000               54
1         Nick    20-03-2000               98
2        Kevin    01-05-1999               63
3          Tom    23-02-1999               38
4         Jack    01-07-1999               94

# 3) Working with Series

In [ ]:
s1=pd.Series(np.random.randint(0,100,size=100))
s2=pd.Series(np.random.randint(0,100,size=100))

add=s1+s2
sub=s1-s2
mult=s1*s2
div=s1/s2

data = {'number 1':s1,  'number 2':s2,  'add':add , 'sub':sub ,'mult':mult,'div':div}

df6=pd.DataFrame(data)
df6

    number 1  number 2  add  sub  mult        div
0          4        67   71  -63   268   0.059701
1         97        23  120   74  2231   4.217391
2         38        38   76    0  1444   1.000000
3         67        87  154  -20  5829   0.770115
4          3        86   89  -83   258   0.034884
..       ...       ...  ...  ...   ...        ...
95        62        27   89   35  1674   2.296296
96        58        38   96   20  2204   1.526316
97        83        53  136   30  4399   1.566038
98        55         2   57   53   110  27.500000
99        99        43  142   56  4257   2.302326

[100 rows x 6 columns]